src/InformationRegisters/ВерсииИнформационнойБазы/ВерсииИнформационнойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииИнформационнойБазы</name>
  <resources>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцедураОбновления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СообщатьДлительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекущееЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПервыйЗапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗавершеноОбновление</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ВерсииИнформационнойБазы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьКрайнююВерсиюОбновления() Экспорт
	 Запрос = Новый Запрос;
	 
	 Запрос.Текст = "
	 |ВЫБРАТЬ
	 |	Версии.Версия КАК Версия
	 |ИЗ
	 |	РегистрСведений.ВерсииИнформационнойБазы КАК Версии
	 |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	 |	(ВЫБРАТЬ
	 |		МАКСИМУМ(ВерсияМаксимум.ВерсияЧисло) КАК ВерсияЧисло
	 |	ИЗ
	 |		РегистрСведений.ВерсииИнформационнойБазы КАК ВерсияМаксимум
	 |	) КАК ВерсияМаксимум
	 |ПО
	 |	Версии.ВерсияЧисло = ВерсияМаксимум.ВерсияЧисло
	 |";
	 
	 Результат = Запрос.Выполнить();
	 Если Результат.Пустой() Тогда
		 Возврат Неопределено;
	 Иначе
		 Возврат Результат.Выгрузить()[0].Версия;
	 КонецЕсли;
 КонецФункции
 
#КонецЕсли
